tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.04478 -0.00550502 -0.29 )
    ( 0.27928 -0.00550502 -0.29 )
    ( 0.27928 0.0845552 -0.29 )
    ( -0.04478 0.0845552 -0.29 )
    ( -0.04478 -0.00550502 0.04 )
    ( 0.27928 -0.00550502 0.04 )
    ( 0.27928 0.0845552 0.04 )
    ( -0.04478 0.0845552 0.04 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ( 108 30 110 ) simpleGrading ( 1 1 1 )
);

edges
(
);

boundary
(
    XMin
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    XMax
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    YMin
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    YMax
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    ZMin
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    ZMax
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
